[net]
batch=64
channels=3
height=416
width=416
subdivisions=8
decay=0.0005
learning_rate=0.0001
hue=.1
max_batches=40200
exposure=1.5
saturation=1.5

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
filters=96
size=1
stride=1
pad=1
activation=linear

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=125
size=1
stride=1
pad=1
activation=linear

[region]
anchors = 1.08,1.19  3.42,4.41,  6.63,11.3
bias_match=1
classes=20
coords=4
num=5
softmax=1
jitter=.2
rescore=1

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1
absolute=1
thresh = .6
random=1
                                                              131,1         Bot

